''' 6. Реализовать генератор с помощью функции с ключевым словом yield,
создающим очередное значение. При вызове функции должен создаваться объект-генератор.
Функция должна вызываться следующим образом: for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо выводить
только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24. '''
from math import factorial

def fact(n):
    num = 1
    for el in range(num, n + 1):
        num *= el
        yield num
        el += 1
    for el in fact(4):
        print(el)

print(f"factorial() -> {factorial(4)}")
