''' 5. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении
числа 10 завершаем цикл. Во втором также необходимо предусмотреть условие,
при котором повторение элементов списка будет прекращено. '''
from itertools import cycle
from itertools import count

new_list = []
for i in count(3):
    if i > 10:
        break
    else:
        new_list.append(i)

print(new_list)

count = 1
for item in cycle('Abcd'):
    if count > 10:
        break
    print(item)
    count += 1